export const PERSONAL_DATA_AGREEMENT = [
  {
    order: 1,
    title: '수집하는 개인정보의 항목',
    content:
      '대장장이는 회원가입 시 아래와 같은 개인정보를 수집하고 있습니다.\n' +
      '- 이메일, 이름, 생년월일, 성별, 휴대폰번호, 거주지역, 내·외국인정보, 암호화된 동일인 식별연계정보(CI)\n' +
      '외부 플랫폼 계정을 이용하는 경우\n' +
      '- 카카오 계정 이용 시 : (필수) 카카오 회원번호\n' +
      '- 외부 플랫폼 인증을 통한 회원가입 시 위 정보 이외에 외부 플랫폼에서 제공하는 다른 개인정보는 대장장이에서 저장하지 않습니다.\n' +
      '서비스 이용과정에서 아래와 같은 정보가 생성되어 수집될 수 있습니다.\n' +
      '- IP Address, 쿠키, 방문 일시, 서비스 이용 기록, 불량 이용 기록, 모바일 서비스 이용시 단말기 정보 (단말기 모델, OS 유형, 이동통신사 정보, 하드웨어 ID, 광고 ID, 서비스 이용에 대한 기본 통계), 애플리케이션 설치 및 사용이력, 결제·구매기록',
  },
  {
    order: 2,
    title: '개인정보의 수집 및 이용목적',
    content:
      '회사는 수집한 개인정보를 다음의 목적을 위해 활용합니다.\n' +
      '- 이용자와 약속한 서비스 제공, 서비스 제공에 따른 본인인증, 구매 및 요금결제, 환불 처리, 상품 및 서비스의 배송, CS 대응 및 제반 업무를 위하여 개인정보를 이용합니다.\n' +
      '- 회원 가입 의사의 확인, 연령 확인 및 법정대리인 동의 진행, 이용자 및 법정대리인의 본인 확인, 이용자 식별, 회원탈퇴 의사의 확인, 문의사항 또는 불만처리 등 회원관리를 위하여 개인정보를 이용합니다.\n' +
      '- 법령 및 이용약관을 위반하는 회원에 대한 이용 제한 조치, 부정 이용 행위를 포함하여 서비스의 원활한 운영에 지장을 주는 행위 및 비인가 행위에 대한 방지 및 제재, 계정도용 및 부정거래 방지, 고지사항 전달, 분쟁 조정을 위한 기록보존 등 이용자 보호 및 안전한 서비스 운영을 위하여 개인정보를 이용합니다.\n' +
      '- 인구통계학적 특성에 따른 서비스 제공, 접속 빈도 분석, 기능개선, 서비스 이용에 대한 통계, 서비스 분석 및 통계에 기반하여 이용자의 상품 구매 및 서비스 이용 성향, 관심, 이용기록 분석 등을 반영한 신규 서비스 제공(개인 맞춤형 상품 추천 서비스 등 포함)등에 개인정보를 이용합니다.\n' +
      '- 이벤트 정보, 광고성 정보 제공 등 이벤트 및 프로모션의 목적 등에 개인정보를 이용할 수 있습니다.',
  },
  {
    order: 3,
    title: '개인정보의 보유 및 이용기간',
    content:
      '회사는 원칙적으로 이용자의 개인정보를 회원탈퇴 시까지 보관합니다. 그 외에도 다음의 정보에 대해서는 회원탈퇴 후에도 아래의 이유로 명시한 기간 동안 보존합니다.\n' +
      '가. 회사 내부 방침에 의한 정보보존 사유별도 보유 정보 보존 이유, 보존 기간대장장이 서비스 이용기록 - 보존 이유: 회원 민원 대응 등- 보존 기간: 30일\n' +
      '나. 관련법령에 의한 정보보존 사유\n' +
      '상법, 전자상거래 등에서의 소비자보호에 관한 법률 등 관계법령의 규정에 의하여 보존할 필요가 있는 경우 회사는 관계법령에서 정한 일정한 기간 동안 회원정보를 보관합니다. 이 경우 회사는 보관하는 정보를 그 보관의 목적으로만 이용하며 보존기간은 아래와 같습니다.\n' +
      '- 서비스 이용에 관한 로그기록\n' +
      '보존 이유 : 통신비밀보호법\n' +
      '보존 기간 : 3개월\n' +
      '- 소비자의 불만 또는 분쟁처리에 관한 기록\n' +
      '보존 이유 : 전자상거래 등에서의 소비자보호에 관한 법률\n' +
      '보존 기간 : 3년\n' +
      '- 계약 또는 청약철회 등에 관한 기록\n' +
      '보존 이유 : 전자상거래 등에서의 소비자보호에 관한 법률\n' +
      '보존 기간 : 5년\n' +
      '- 대금결제 및 재화 등의 공급에 관한 기록\n' +
      '보존 이유 : 전자상거래 등에서의 소비자보호에 관한 법률\n' +
      '보존 기간 : 5년\n' +
      '이용자는 개인정보 수집 및 이용 동의를 거부할 권리가 있습니다. 다만 개인정보 수집 및 이용 동의를 거부하실 경우 가입 요청하신 서비스 이용이 제한되거나 불가할 수 있습니다.',
  },
];

export const SENSITIVE_DATA_AGREEMENT =
  ' · 민감정보 수집 · 이용 목적 :\n' +
  ' · 수집하는 민감정보 항목 : 이용자가 직접 캘린더에 기록한 배변기록(날짜, 증상, 배변 여부), 체중, 노트기록\n' +
  ' · 민감정보의 보유 및 이용 기간 : 직접 기록을 삭제하거나 회원탈퇴 시까지\n' +
  '\n' +
  '※ 동의를 거부하실 수 있으나, 동의하지 않으실 경우 서비스 가입이 제한되거나 불가할 수 있습니다.';
